# Задачи по обработке чисел:
# 3. Даны два числа. Найти среднее арифметическое и среднее геометрическое этих чисел

# Среднее арифметическое нескольких чисел — это сумма данных чисел, делённая на их количество

# корень из произведения исходных данных, где степень определяется количеством множителей.
# Например, среднее геометрическое двух чисел – это квадратный корень из их произведения

a = 10
b = 20
srednee_arifmeticheskoe = (a+b) / 2
srednee_geometricheskoe = (a * b) ** 0.5

print("Srednee arifmeticheskoe =",srednee_arifmeticheskoe,"Srednee Geometricheskoe =",srednee_geometricheskoe,".")